{
  "thread": {
    "title": "My friend enjoys watching women being tortured. I'm deeply disturbed and don’t know what to do.",
    "content_warning": "Violence",
    "author": "Dexflamed",
    "post_date": "5 hr. ago",
    "text": "I’m writing this because I’m seriously worried about a friend of mine. He told me (and sometimes even shows me) that he enjoys watching women being tortured. Not horror movies or fictional stuff, but real or realistic portrayals of extreme violence. He seems to get pleasure from it. At first, I thought he was joking or just trying to act edgy, but I’ve realized it’s more than that. He talks about it casually, like it's normal. I’m starting to think this isn't just a “weird interest” but something really dangerous. I’m scared he might hurt someone someday, or that he's already deeply unwell. He hasn’t hurt anyone (as far as I know), but I don’t think this is something I can just ignore. I don’t want to make things worse by accusing him or pushing too hard, but I also don’t want to wait until it’s too late. What should I do? How can I report this or get him help before something happens? Has anyone dealt with something like this before? I live in Laos. if that affects what kind of help is available? Any advice is appreciated. This is really freaking me out.",
    "upvotes": 37,
    "downvotes": 48
  },
  "comments": [
    {
      "author": "Number_Fluffy",
      "date": "5h ago",
      "text": "You are very right to be concerned. I'm not sure what you can do though. He needs professional help.",
      "upvotes": 42,
      "downvotes": 0
    },
    {
      "author": "Jumpy_Feature",
      "date": "4h ago",
      "text": "I saw in one of your posts that you are 17. Do you go to school? If so, talk to a counselor/a staff member you trust about this. This is seriously alarming and you could help potentially stop something seriously bad happening.",
      "upvotes": 33,
      "downvotes": 0
    },
    {
      "author": "Jumpy_Feature",
      "date": "4h ago",
      "text": "Also, I don’t mean to embarrass you or anything of that sort, I understand that mental health is a very complex and scary thing, and I’m truly just trying to help here. That’s why i say this with the utmost empathy and concern but… are you sure you’re talking about a friend here?",
      "upvotes": 16,
      "downvotes": 0
    },
    {
      "author": "macabreomens",
      "date": "3h ago",
      "text": "Folks, OP mentioned in one of the comments that his friend is using tor browser which makes me think whatever this friend of OP's is consuming is far beyond stuff like bdsm. Probably, some outright illegal stuff. I don't know which country OP is from and I anyway don't feel equipped to say what OP can do in this situation. I'm hoping someone has some advice for OP.",
      "upvotes": 15,
      "downvotes": 0
    },
    {
      "author": "Aggressive_Shift1712",
      "date": "4h ago",
      "text": "By real do you mean he goes to websites and finds real videos of real women being tortured? Either way that behavior could develop into him wanting more. What I mean is he could start doing that to women himself which is concerning. Gore is an addiction and when people can’t get enough it can lead to someone getting hurt and killed",
      "upvotes": 8,
      "downvotes": 0
    },
    {
      "author": "Dexflamed",
      "date": "4h ago",
      "edited": "2h ago",
      "text": "Yes.He said hes using tor browser to find those videos to feed his urges.Sometimes he goes insane like he has to do it.He said nowdays he finish his urges or whatever by torturing and killing women in games.I am very scared what if he do this to real women?Can you pls help.He said he wont go to therapist so what i can do best as a good friend.",
      "upvotes": 12,
      "downvotes": 0
    },
    {
      "author": "MaverickFischer",
      "date": "3h ago",
      "text": "Is this REALLY a friend?",
      "upvotes": 8,
      "downvotes": 0
    },
    {
      "author": "Huge_Meaning_545",
      "date": "2h ago",
      "text": "Given your replies and such, I'm hesitant to believe this is an enquiry about a friend. Either way, whoever is having these feelings/issues, needs to seek professional help ASAP.",
      "upvotes": 7,
      "downvotes": 0
    },
    {
      "author": "_Oolon_",
      "date": "2h ago",
      "edited": "2h ago",
      "text": "You should defiantly report this to someone with authority. Even if they can't do anything, at least you tried. Also, I would recommend cutting ties with him. Pick your friends wisely.",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "No_Gazelle342",
      "date": "4h ago",
      "text": "How is this person in other areas of life ? I'm sure that as a friend, you may know a lot of things that others can't see from him in public.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "synthetic_aesthetic",
      "date": "3h ago",
      "text": "Our culture in general fetishizes harming or punishing women. Finding pleasure from seeing women be tortured is a natural extension of that programing and not at all some kind of rare anomaly. Seeing this should spark conversations about our culture as much as it is important to address this one individual’s potential risk to other women.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "flyingduck0",
      "date": "1h ago",
      "text": "you need to tell a trusted adult asap.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Name_20",
      "date": "32m ago",
      "text": "He needs to talk to a therapist. He is already hurting woman by supporting people doing it through watching the content (if I understood correctly that these videos are from real life). Plus, people usually do have a stop in their head and they feel really bad seeing stuff like this. Not having this stop for seeing it might also mean that he does not have the stop for doing it or, he stops at \"a later point\", which means he might not kill somebody but maybe stalk them or touch them in an inapropiate way. (sorry for my english, didnt know how to write it in a correct way). This can already cause trauma and destroy somebodys life. Like, omg being stalked is so creepy and it really destroys the feeling of beeing safe. Like people get panic attacs because they are so afraid. So, if he does not seem willing to go to a therapist and work on his view of woman, I am sorry to say that you need to report him to police. I dont know how close you are to him, but isnt somebody who doesnt have enough empathy to work on himself for beeing a kind person not a good friend anyway? At least I myself always watch how a person treats other people before deciding if I want to have them in my life.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Relevant_Call_2242",
      "date": "1h ago",
      "text": "I’d report that to the local police and fbi if I were in your shoes",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "MichaelEmouse",
      "date": "4h ago",
      "text": "The urge to watch those videos probably comes when he gets some triggers. Stress could trigger it. When the urge comes, he should focus on something else which is healthier. Other things he enjoys or calm him. He should consult a therapist. He should also realize that it's his some of his behavior which is a problem, not him. He can get better.",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "Useful-Effect-4963",
      "date": "8m ago",
      "text": "thats messed up.",
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "_sdfjk",
      "date": "7m ago",
      "text": "not your friend anymore. you dont support what he finds entertaining. whatever path he took it surely isn't the path to kindness",
      "upvotes": 0,
      "downvotes": 0
    }
  ],
   "thread_2": {
    "title": "ypu are not alone",
    "content_warning": null,
    "author": "illumx84_",
    "post_date": "5 hr. ago",
    "text": "To all of you who are struggling, I just wanted you to know if you need to talk to someone, to vent, to feel supported or just listened to, I am here.",
    "upvotes": 12,
    "downvotes": 5
  },
  "comments": [
    {
      "author": "kudosfish5",
      "date": "5h ago",
      "text": "thankyouthankyou, i love your words and appreciate you",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "illumx84_",
      "date": "4h ago",
      "text": "Thank you, I'm really glad you appreciate this message, I wish you a great day and hope you're doing well",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "delta_hotel3443",
      "date": "3h ago",
      "text": "You my friend are an amazing person",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Trick_Alps774",
      "date": "3h ago",
      "text": "thank you",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Feisty-olde-7707",
      "date": "1h ago",
      "text": "Thank you for this. Believe it or not this post just saved my life. I was wondering if this would be the day I choose… I have been trying to write a post for hours. Crying like a baby. My heart is too heavy…",
      "upvotes": 1,
      "downvotes": 0

  }
],
"thread_3": {
    "title": "Redditors let’s get together and list 100 reasons to stay alive",
    "content_warning": null,
    "author": "Antiviral21",
    "post_date": "7 days ago",
    "text": "RULES: everyone can only comment one reason. Let’s try to get 100+ comments. Edit: Wow I did not expect to get 100+ comments so soon! Can we get to 1k+ comments?",
    "upvotes": 796,
    "downvotes": 663
  },
  "comments": [
    {
      "author": "DimesyEvans92",
      "date": "7d ago",
      "text": null,
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "matthew65536",
      "date": "7d ago",
      "text": "Cats",
      "upvotes": 329,
      "downvotes": 0
    },
    {
      "author": "AkaruLyte",
      "date": "7d ago",
      "text": "Getting to that one mind-bendingly amazing part of your favorite song.",
      "upvotes": 201,
      "downvotes": 0
    },
    {
      "author": "Sple3N1",
      "date": "7d ago",
      "text": "To watch and listen to waves 🌊",
      "upvotes": 162,
      "downvotes": 0
    },
    {
      "author": "HottieMcNugget",
      "date": "7d ago",
      "text": "Potatoes",
      "upvotes": 152,
      "downvotes": 0
    },
    {
      "author": "zedesseff",
      "date": "7d ago",
      "text": "Puppies.",
      "upvotes": 148,
      "downvotes": 0
    },
    {
      "author": "nirvanagirllisa",
      "date": "7d ago",
      "text": "There will always be more good books to read",
      "upvotes": 140,
      "downvotes": 0
    },
    {
      "author": "InfinityBlicky",
      "date": "7d ago",
      "text": "Food!!!! you probably haven't even had your favorite meal/cookie/drink/ice cream yet!!!",
      "upvotes": 132,
      "downvotes": 0
    },
    {
      "author": "notdiams",
      "date": "7d ago",
      "text": "Rain. I love rainy weather",
      "upvotes": 124,
      "downvotes": 0
    },
    {
      "author": "After-Recording-5839",
      "date": "7d ago",
      "text": "That perfect first sip of your favorite drink (mine's matcha!!)",
      "upvotes": 104,
      "downvotes": 0
    },
    {
      "author": "iluvelena",
      "date": "7d ago",
      "text": "Experiencing golden hour sun!! (gives me a hundred years of life every time) ☀️",
      "upvotes": 90,
      "downvotes": 0
    },
    {
      "author": "Double_Hamster3547",
      "date": "7d ago",
      "text": "Chocolate",
      "upvotes": 76,
      "downvotes": 0
    },
    {
      "author": "Money-Resource-7077",
      "date": "7d ago",
      "text": "Walks in a pretty forest with the people you love",
      "upvotes": 72,
      "downvotes": 0
    },
    {
      "author": "FeistyDoughnut4600",
      "date": "7d ago",
      "text": "G R R Martin might publish the last Game of Thrones book",
      "upvotes": 59,
      "downvotes": 0
    },
    {
      "author": "Ancient-Split1996",
      "date": "7d ago",
      "text": "Let's not get crazy here",
      "upvotes": 50,
      "downvotes": 0
    },
    {
      "author": "electric-snow-100",
      "date": "7d ago",
      "text": "The cure could be close",
      "upvotes": 62,
      "downvotes": 0
    },
    {
      "author": "Sirius_Giggles",
      "date": "7d ago",
      "text": "The curiosity of life, and learning something new about your special interests.",
      "upvotes": 48,
      "downvotes": 0
    },
    {
      "author": "zeldaalove",
      "date": "7d ago",
      "text": "Watching a really good movie for the first time",
      "upvotes": 46,
      "downvotes": 0
    },
    {
      "author": "Dull-Simple7700",
      "date": "7d ago",
      "text": "Fountain pens",
      "upvotes": 44,
      "downvotes": 0
    },
    {
      "author": "destroyingangel_777",
      "date": "7d ago",
      "text": "Sunsets",
      "upvotes": 43,
      "downvotes": 0
    },
    {
      "author": "Taurus-official",
      "date": "7d ago",
      "text": "Maybe one day you see the desperate or lifeless look in someone's eyes, and you recognize those eyes from the mirror. And maybe you can do something to help them.",
      "upvotes": 40,
      "downvotes": 0
    },
    {
      "author": "peachboot828",
      "date": "7d ago",
      "text": "That first day that you can tell autumn is just around the corner. There’s something about the quality of the evening sunlight, the crispness of the wind, a certain smell put off by the trees…it’s like everything is getting ready to put on a grand show and then go take a nap. Every year, it never fails to move me.",
      "upvotes": 41,
      "downvotes": 0
    },
    {
      "author": "SilverResearcher9384",
      "date": "7d ago",
      "text": "To achieve your purpose in life and leave behind a legacy, even if it was about changing and helping one person who will never forget you",
      "upvotes": 37,
      "downvotes": 0
    },
    {
      "author": "No_Names78",
      "date": "7d ago",
      "text": "A hot bubble bath.",
      "upvotes": 39,
      "downvotes": 0
    },
    {
      "author": "ThatOneGuyJay0",
      "date": "7d ago",
      "text": "Goth chicks!! The best kind!",
      "upvotes": 39,
      "downvotes": 0
    },
    {
      "author": "SimilarCourage2306",
      "date": "7d ago",
      "text": "Teddy bears. (I cannot be alone without mine lol)",
      "upvotes": 35,
      "downvotes": 0
    },
    {
      "author": "Icy-Coconut8233",
      "date": "7d ago",
      "text": "Cats",
      "upvotes": 32,
      "downvotes": 0
    },
    {
      "author": "overSizedHyperPoop",
      "date": "7d ago",
      "text": "Your pet",
      "upvotes": 34,
      "downvotes": 0
    },
    {
      "author": "KingsleyBrewMaster22",
      "date": "7d ago",
      "text": "Spite",
      "upvotes": 31,
      "downvotes": 0
    },
    {
      "author": "pepperbren0",
      "date": "7d ago",
      "text": "To leave behind a better world than that you first met",
      "upvotes": 28,
      "downvotes": 0
    },
    {
      "author": "destroyingangel_777",
      "date": "7d ago",
      "text": "Bacon",
      "upvotes": 29,
      "downvotes": 0
    },
    {
      "author": "Casual_Salmonid",
      "date": "7d ago",
      "text": "Experiencing the first bite of a warm homemade loaf of bread",
      "upvotes": 26,
      "downvotes": 0
    },
    {
      "author": "awittyusername87",
      "date": "7d ago",
      "text": "The smell of freshly cut grass!",
      "upvotes": 27,
      "downvotes": 0
    },
    {
      "author": "Aromatic_Ad_3312",
      "date": "7d ago",
      "text": "Freshly made beds!",
      "upvotes": 25,
      "downvotes": 0
    },
    {
      "author": "Call_It_",
      "date": "7d ago",
      "text": "Coffee. Music. Marijuana. Art. Not sure I can list many more. Then again…these are merely coping mechanisms for existing, I’m not sure they’re “reasons to live”.",
      "upvotes": 25,
      "downvotes": 0
    },
    {
      "author": "Kbudski",
      "date": "7d ago",
      "text": "Music, Art and coffee are definitely reasons to live. I shall rise from the dead every morning to have my coffee with honey and milk. While music and art have not only saved so many people, it provides a good way to cope with things too.",
      "upvotes": 6,
      "downvotes": 0
    },
    {
      "author": "LianaBlue",
      "date": "7d ago",
      "text": "To play amazing videogames!",
      "upvotes": 24,
      "downvotes": 0
    },
    {
      "author": "parkerzstarz",
      "date": "7d ago",
      "text": "sunrises",
      "upvotes": 24,
      "downvotes": 0
    },
    {
      "author": "Kbudski",
      "date": "7d ago",
      "text": "The bird song that comes along with it too",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "tw1sted-trans1stor",
      "date": "7d ago",
      "text": "Rollercoasters! That thought has actually helped me so many times lol",
      "upvotes": 22,
      "downvotes": 0
    },
    {
      "author": "PlsGiveMeKiki",
      "date": "7d ago",
      "text": "being with people you can goof around with, and who make you laugh uncontrollably",
      "upvotes": 21,
      "downvotes": 0
    },
    {
      "author": "astroares",
      "date": "7d ago",
      "text": "laying in bed late at night knowing you can just breathe because nothing is waiting for you the next day",
      "upvotes": 22,
      "downvotes": 0
    },
    {
      "author": "thebreadstop",
      "date": "7d ago",
      "text": "Spending time in nature, next to a flowing river",
      "upvotes": 19,
      "downvotes": 0
    },
    {
      "author": "Wooden-Advance-1907",
      "date": "7d ago",
      "text": "Cheese",
      "upvotes": 18,
      "downvotes": 0
    },
    {
      "author": "MadBlackQueen",
      "date": "7d ago",
      "text": "To prove everybody wrong!",
      "upvotes": 21,
      "downvotes": 0
    },
    {
      "author": "parkerzstarz",
      "date": "7d ago",
      "text": "a perfect sear on a stainless steel pan 🌝",
      "upvotes": 17,
      "downvotes": 0
    },
    {
      "author": "ablackbarbie",
      "date": "7d ago",
      "text": "for me it’s living to see myself glow up",
      "upvotes": 17,
      "downvotes": 0
    },
    {
      "author": "Free_Rip2616",
      "date": "7d ago",
      "text": "My cat purrs when she sleeps on my chest",
      "upvotes": 17,
      "downvotes": 0
    },
    {
      "author": "GArockcrawler",
      "date": "7d ago",
      "text": "This is one of the “tests” I told my husband to use, should I ever be medically so bad off that they are determining whether to save me or not. If I can no longer enjoy the sound of my cat purring, it’s time to let me go.",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "Opal_L",
      "date": "7d ago",
      "text": "All the different foods to try!",
      "upvotes": 16,
      "downvotes": 0
    },
    {
      "author": "Just-Seaworthiness39",
      "date": "7d ago",
      "text": "Being in love.",
      "upvotes": 20,
      "downvotes": 0
    },
    {
      "author": "Antiviral21",
      "date": "7d ago",
      "text": "what if you cant find love?",
      "upvotes": 8,
      "downvotes": 0
    },
    {
      "author": "TicklingMePickle",
      "date": "7d ago",
      "text": "Weekly episodes of anime.",
      "upvotes": 16,
      "downvotes": 0
    },
    {
      "author": "Maximus_Inaproprimus",
      "date": "7d ago",
      "text": "Realisation that life will end one day even if you don't do anything about it, might just have fun along the way",
      "upvotes": 16,
      "downvotes": 0
    },
    {
      "author": "Bloodlust_047",
      "date": "7d ago",
      "text": "Art!! Not only consuming it but also creating"
    }
  ],

  "thread_4": {
    "title": "I sought help during a psychiatric crisis—and the system turned me into a criminal.",
    "content_warning": null,
    "author": "Smart_Specific4531",
    "post_date": "10d ago",
    "text": "I’m a former registered nurse. I used to advocate for patients in distress. I believed in the healthcare system. I believed in doing the right thing. But when I had my own psychiatric emergency, I learned the hard way that those same systems don’t always show up for people like me—especially if your disability is invisible. In 2024, after my provider tapered me off my psychiatric meds, I became severely overstimulated at work. I tried to do the responsible thing. I drove myself to a behavioral health ER in New Lenox, IL. I wasn’t violent. I wasn’t a threat. I was in distress. I needed help. They admitted me—but later issued a warrant for my arrest based on behavior that happened during that mental health episode. I didn’t even know until I was arrested five months later—in another state—while still in active psychosis. I sat in jail for 30 days awaiting extradition. No care. No understanding. Just punishment. And it didn’t stop there. Despite being hospitalized and submitting a signed accommodation request from my doctor, I was forced out of my apartment. Management outright denied my disability. This, despite me receiving SSDI, having a well-documented condition, and being taken away by ambulance during a clear psychiatric emergency. They claimed my symptoms weren’t related to mental illness at all—they labeled it criminal behavior. I guess if you speak clearly and look “put together,” you’re not mentally ill. You’re just a problem to be removed. Now I’m stuck in limbo with the SSA. I applied for expedited reinstatement of my disability benefits nearly a year ago—after my trial work period failed and I had multiple hospitalizations. SSA policy says it should take 30 days. I’ve received nothing but duplicate letters falsely stating I’m employed and endless contradictions from representatives. I have to request critical payments monthly just to survive. I went from nurse… to criminalized… to forgotten. All for doing what I was taught to do: ask for help. I’m posting this because I know I’m not alone. There are others out there with psychiatric disabilities who’ve been judged, punished, or ignored because we don’t “look” disabled. Because we’re too “put together” or “coherent” to be believed. If this has happened to you, I see you. And I hope someday these systems will see us too. Thanks for reading.",
    "upvotes": 694,
    "downvotes": 144
  },
  "comments": [
    {
      "author": "bendybiznatch",
      "date": "10d ago",
      "text": "I genuinely don’t have words. That could be a horror movie.",
      "upvotes": 303,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "That’s exactly how it feels. Like I’m trapped in a horror movie that won’t end, and the most twisted part is, it all started just because I asked for help. I didn’t commit a crime. I reached out while in crisis, and they turned that vulnerability into a weapon against me.",
      "upvotes": 171,
      "downvotes": 0
    },
    {
      "author": "Justber2323",
      "date": "9d ago",
      "text": "I second this, just, no words. So sad this happened, so very wrong",
      "upvotes": 10,
      "downvotes": 0
    },
    {
      "author": "MightPhysical2999",
      "date": "10d ago",
      "text": "I'm confused. What crime do they say you committed?",
      "upvotes": 101,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "They charged me with assaulting a peace officer (security) while I was in active psychosis—after he balled up his fist and made me feel completely threatened. Instead of de-escalating, like they’re trained to, they treated me like a criminal because I “looked normal.” They dropped the felony peace officer charge, but I’m still on supervision… for knocking over a hand sanitizer stand. Yes, that’s the “property damage.” 🤦🏽‍♀️ Mental illness isn’t a crime—but the way they handled me should be.",
      "upvotes": 223,
      "downvotes": 0
    },
    {
      "author": "Wanderingstar8o",
      "date": "10d ago",
      "text": "The system is so screwed up & it seems as if no one knows how or has any plans to fix it or create a new system",
      "upvotes": 32,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "Yes—because the system isn’t just broken, it’s built this way. They profit off the chaos. That’s why there’s never a clear solution—confusion is the strategy. Why pay disabled people what they’re owed when they can stall, deny, and keep the money? Why treat mental illness when they can criminalize it and fill jails instead? It’s not incompetence—it’s capitalism in a lab coat.",
      "upvotes": 34,
      "downvotes": 0
    },
    {
      "author": "blueevey",
      "date": "10d ago",
      "text": "I'm sorry that happened to you",
      "upvotes": 13,
      "downvotes": 0
    },
    {
      "author": "BigScaryPooPooMan",
      "date": "10d ago",
      "text": "So sorry your going through this, I wish there was more we could do. Are you at least getting a free lawyer? I feel like they all should be sued",
      "upvotes": 10,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "I sued my employer. I have my apartment complex under investigation with the Human Rights Department, and I’m close to a substantial finding and a lawsuit. I plan to get a lawyer once that comes through. My supervision ends in October, and after I seal and expunge my record, I WILL sue the hospital and the doctor who tapered me off my medication just because they thought I “looked well” and didn’t need it. I’m also currently suing my ex-boyfriend for financially exploiting me during that time—he even tried to take out life insurance on me. All of this feels unreal. I’m just venting and getting it out of my head. Thanks for the advice.",
      "upvotes": 31,
      "downvotes": 0
    },
    {
      "author": "Brave_Specific5870",
      "date": "10d ago",
      "text": "It is a horror movie. Several movies that have psych ward scenes are often not accurate and abuse the character. I believe uhhh Sucker punch? I think it’s called?? Is a good representation, hell even Girl, Interrupted to a pointed. Lisa Rowe states, ‘ Then you’re a lifer like me.’",
      "upvotes": 6,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "I’ve been hospitalized over 12 times since 2011. Not all of them were bad, but some were absolute horror stories. I’ve had staff flirt with me, rub their privates against me, and I’ve seen men openly jerking off. It’s traumatizing. People think mental health treatment is safe, but they don’t know what really goes on behind locked doors.",
      "upvotes": 12,
      "downvotes": 0
    },
    {
      "author": "bloss0m123",
      "date": "10d ago",
      "text": "I am so disappointed in so many systems right now",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "Limbitch_System0325",
      "date": "10d ago",
      "text": "I’m so, incredibly sorry you were failed. That’s a waking nightmare I wouldn’t wish on my worst enemy, and I’m angry and saddened for you. This world is not kind to people like you and me, who suffer in ways most people can’t comprehend. Losing touch with reality is the scariest thing that’s ever happened to me, and nobody but those who already love me gets why I fear it every time it starts to come back around. The mental healthcare system is fucked.",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "celtic_thistle",
      "date": "10d ago",
      "text": "Please reach out to a Center for Independent Living in your area and ask for help with the SSA situation. The non-attorney reps I know in my own experience in disability services are amazing and know their stuff. If the CIL doesn’t have those specialists, they will refer you to another CIL that does—usually there’s a bunch of SSA experts who work with the entire state, and one thing central to a CIL being designated as such, is for them to provide information and referrals even when their org doesn’t have a specific resource they can provide. Anyway. Call a CIL. They’re run for the disabled, by the disabled. They have been an excellent resource in my own work (brushing up against nonprofits.) I believe if you get approved and receive back pay, the SSA staff will get a percentage of the back pay, to sustain the program. That’s only if you get approved and get back pay. Everything else CILs do is free, afaik. Find US-based CILs here and get ahold of them.",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "NarwhalGlittering515",
      "date": "10d ago",
      "text": "How they treated you is criminal. Why on earth did your doctor wean you off meds?",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "Because I was doing great… so naturally, they wanted to ‘decrease the risk of side effects’ 🙄.",
      "upvotes": 6,
      "downvotes": 0
    },
    {
      "author": "Fenlaf13",
      "date": "10d ago",
      "text": "I'm so sorry. I'm speechless. 💔",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "ShutterBug1988",
      "date": "10d ago",
      "text": "I'm so sorry this happened to you! I've been fighting for flexibility and accommodations in my workplace and the whole process is so dehumanising and such a struggle that I've considered just leaving even though I love my job. All I'm asking for is a bit of leniency around the time I start because I get terrible insomnia as a comorbid condition but I'm constantly told that I'm late for work and have to inform my supervisor that everyday that I'm \"late\". Even though they say there's access to flexible work conditions, none of the policies actually help staff to access them and you're made to feel like you're on a performance management plan as if you're not capable of or are purposely avoiding doing your job. Btw, this is a job in my state government (in Australia) which legislates that employers must accommodate disabilities, including neurological disorders. Yet they aren't willing to allow me to start my workday 15-30 minutes later than the core business hours even after giving them medical reasons for my request.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Brrringsaythealiens",
      "date": "10d ago",
      "text": "This is so awful and I don’t think you’re alone; I’ve read that something like sixty percent of prisoners are diagnosed with mental illness. Really makes you think about what we’re really doing, warehousing people when they need help.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "LJ1205E",
      "date": "9d ago",
      "text": "What you’ve been through is disgraceful, shame on the system! Stay strong! Like another poster said, I stay quiet and keep my real thoughts to myself. Had a horrible experience at a mental hospital. I don’t ever want to go back. There must be other decent ones and people who truly want to help. But I didn’t encounter any of them. I was in session with my psychiatrist when she convinced me to check myself in. She walked me down to the ER. They left me in a tiny room with a toilet for 10 hours and a bottle of water. I was terrified and told the nurses I felt much better and decided I wanted to go home. The nurse said you leave here and by the time you get home there will be police waiting to arrest you. Hour 12 and I was taken off in an ambulance to an airfield in the middle of the night. There isn’t any mental hospitals close so it was an hour flight. Once I got there and stripped searched in a semi dark room I was then given the rules. What was supposed to be 3 days became 5. I spoke with a psychiatrist for all of 15 minutes.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "9d ago",
      "text": "This is sooooo very true and the reality many don’t realize they claim people are mentally ill after assessing them for like 3 minutes really. Many of these doctors suck!",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "JuggernautNegative41",
      "date": "10d ago",
      "text": "Yeah. I was very shocked at the reality of how the system actually works. I think a lot of it comes down to funding and cost cutting but I am not 100% sure. People can't access help and that is actually scary. Sure you can go to the ER or call a crisis line but does that help you, does that solve it? It doesn't always. Sometimes it makes things more complicated. It's complex and sometimes harms people more. So anyway, it sounds like tapering off your meds most likely wasn't a good idea. Maybe go meet with your doctor, tell them what is going on and see if they can advocate for you or find one for you. But since you said you think their judgement was questionable maybe now it's time to find a better psych dr. and do you have a counselor you go to as well? I'm saying this kindly, I'm not judging you here ok but if you were having psychosis or were in a hyper active state I don't know what your illness is but with some you can lose the ability to remember things that happen in those states. It will actually shock you because you had no idea. You sound aware and conscious of the fact that you have this going on and are trying to be responsible. I'm really sorry too that you deal with this. I hope you are not alone and that you have support that will be best. I am really angry with your doctor too if you have this condition you should not be off the meds and like i said only lowered dosage to test to see how you do on it lowered and then if not it goes back up...",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "I don’t know what it is—they say psychosis, but I’ve noticed it always happens during my period. I’m always in the hospital while on my cycle. I lose touch with reality, feel like I’m in a movie, like there are cameras in the walls watching me. It’s strange, and I don’t know how I even start thinking that, but it keeps happening. I can only remember parts of it. It’s terrifying. I am going to sue to doc",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "needclarificationhlp",
      "date": "10d ago",
      "text": "I lost faith in mental health care after being misdiagnosed with a severe mental illness and was put on so much medicine that ended up making me feel so much worse. This was a state funded clinic. The only time I felt normal was being diagnosed with ADHD and PTSD and taking stimulants. It's when I was working and had insurance. Probably 2019/2020. I had a child and some bad personal stuff happened in my life, so I went to the state clinic and got diagnosed with bipolar disorder. I've been off medicine since March and feel a lot better. Not like a crazy amount of feel better, just I can actually function again. Your story is definitely the worse case scenario. I'm sorry that happened to you because that's terrifying. I wish mental health care was better.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "I’m glad you’re feeling better. My case is rare—my new doctor even told me that. So yay, I guess I won the mental health experience jackpot 🙃. But honestly, I’ve seen people in even worse situations who feel like no one cares. I do. I see them. And I wish more people did. The misdiagnose everyone, literally.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "honeybeesocks",
      "date": "10d ago",
      "text": "silver cross in new lenox? i’m so sorry. i had an awful experience there as well.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "Yes—Silver Cross ‘psychiatric’ hospital in New Lenox.Trash. The staff were completely unprofessional. I will never go to that ER again. We shouldn’t have to go through trauma just for seeking help. It’s disgusting how people in crisis are treated. Absolutely horrible.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "UnhappyAuthor9925",
      "date": "10d ago",
      "text": "You need a lawyer to fight SSA. There are lawyers who do this for free and then take a portion of the settlement.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Smart_Specific4531",
      "date": "10d ago",
      "text": "I’m definitely going to look into this! Thanks! I already contacted one lawyer who said they’d help me if it comes down to an appeal, but I’m calling another one too. I’m not playing around—this is my life and I’m not letting the system walk all over me anymore.",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "nerdzilla19",
      "date": "10d ago",
      "edited": "10d ago",
      "text": "My heart goes out to you. Not exactly the same, but I've been there done that got the T-shirt. The system is not to help people get better. They can write stuff up however they see fit bc if you're in a psych unit, you're not stable and don't \"know what you're doing\" My worst hospitalization I was \"punching walls\"-yeah, I wasn't punching. I was testing reality during an episode of derealization by silently and not violently pushing on the wall with my fist. Leaned into it. I must have had 3 \"Trinity\" shots (haldol, Ativan, benadryl). They restrained me on a bed directly under a light in the quiet room for a few hours, realized I wasn't sleeping, wondered why I was upset with them (still no violence), gave me three more shots bc I \"needed to sleep\" after letting me out of restraints. They had me in the hallway next to the quiet room overnight, where I did not sleep bc my already diagnosed PTSD wouldn't let me sleep bc I had acquired new trauma being centered under a light with no way to move for hours. I thank the Lord for keeping me out of there for 6 years after 10 years of being a frequent flyer. I never thought it would happen. Hang in there. Your hope is out there, even if you can't hold it yet, it's out there. You're probably better off looking at resources within the consumer/survivor/ex patient movement, at this point from what you've shared, there's little to no opportunity for actual help in the standard system. Edit:typo and formatting",
      "upvotes": 1,
      "downvotes": 0
    }
  ],

  
  "thread_5": {
    "title": "my boyfriend is causing me to spiral",
    "content_warning": null,
    "author": null,
    "post_date": null,
    "text": "i have borderline personality disorder and my favorite person is my bf. before we got together he told me he still had a friendship with his ex. he still calls her his sons step mom. they still have anniversary dinners even though theyve been broken up for 5 years or so. they talk all the time. i didnt realize the extent of their relationship until recently. and its been driving me crazy. and since i dont know everything my brain tries to make assumptions about whats going on and its always worst case scenarios and i spiral myself into insanity over it. and usually i would self destruct and blow up the relationship over stuff like this but i dont want to do that this time. so i tried to ask him about it to get some clarification and he blew up at me, was super defensive and angry, so i started crying and went to bed. the next day he didnt talk to me much even though we were in the same room. i felt sick to my stomach and i told him i felt unwell and he came at me with hostility asking if i had anything i wanted to say after last night. i was upset he came at me so aggressively so i didnt engage with him and told him to leave me alone which pissed him off more. then he said he was taking me home so i packed my stuff and told him i didnt need a ride and i was leaving. he continued screaming at me that him and his ex are good friends and i knew this. and i tried to explain my problem wasnt with her it was the way he was reacting to my questions and him yelling. then he tried to tell me i came at him aggressively last night and i couldn’t remember because i was so drunk and insulted my mental health issues and alcohol problems. i know this isnt true though because i remember how the conversation went the day before. i went down the street and he followed me and asked for his apartment key back. i said i wasnt breaking up with him and he said okay and went back home and left me on the street. i didnt feel like walking hours through the hood to get home so i went back and he pretended nothing happened and was laughing and joking with me like everything was fine. then he took me out and weve had a good past few days but we havent talked about it and im starting to spiral again. i still have no answers about the ex situation and if anything its looking way worse than it was. how could he scream at me over her like that ? i dont know him to act like this and everytime i look at him i think about it. i dont want to bring it back up if he gets mad again but its driving me crazy. what do i do ??? there was also a situation where a girl posted sexually suggestive photos on her instagram with him in them. it was weird and i brought it up multiple times and he brushed it off as a joke. it was up for months and he knew it made me uncomfortable but he didnt do anything. then we got in an argument because my phone lost service and he didnt know where i was all day and he knew i was around guys (my girlfriends boyfriends) and accused me of infidelity. i said i didnt want to hear about loyalty from him because of the post and pretty much effectively won the argument with that. the next day the post is removed. he claims he did that on his own because he just didnt like how it looked and it had nothing to do with our argument but that doesnt feel true. is this clearly manipulative ?",
    "upvotes": 1,
    "downvotes": 2
  },
  "comments": [
    {
      "author": "AuctrixFortunae",
      "date": "13m ago",
      "edited": "7m ago",
      "text": "holy shit. girl you do not need that man in your life. him screaming at you and berating you is enough let alone the fact that he’s obviously gaslighting you by shifting the blame towards you being the aggressive one, and acting like nothing happened after leaving you stranded like that. if he isn’t cheating on you then he’s obviously at least considered it, that’s why he’s so quick to accuse you of cheating, he’s projecting. this is the kind of man that WILL abuse you and his anger WILL become violent if you continue to put up with this by staying with him. you seriously need to get out of that situation as fast as you can, and don’t tell him you’re leaving beforehand, just get your things in order and go. this is the kind of man that, if he finds out you plan to leave him, is VERY likely to get physical. please keep yourself safe, you can do so much better than him i promise.",
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Olistu_",
      "date": "4m ago",
      "text": "Bros not good by any means.bro is the Devil Screaming for no reason extreme sign of wrong doing Calling out your mental health problems in that way is not ok Being in a sexualy sugchestive foto aint good Acting like nothing happened You need to leave him he aint a good person And if you think he will be sad if i go Im pretty sure he doesnt care about you So please leave and find someone who actually loves you",
      "upvotes": 0,
      "downvotes": 0
    }
  ],

  "thread_4": {
    "title": "She Left Me at 11, and I’m Still Trying to Understand Why.",
    "content_warning": null,
    "author": "Marshams2009",
    "post_date": "24 days ago",
    "text": "When I was 11 years old, my mother left me. Not in the dramatic way you see in movies—no police, no CPS, no frantic calls. Just absence. One day she was there, the next she wasn’t. It wasn’t sudden if I’m honest. There were signs leading up to it. She would disappear for hours, sometimes days, claiming she needed “time to think” or that she was “just taking care of things.” But she always came back—until she didn’t. I remember the last day vividly. She made me eggs that morning. We didn’t talk much over breakfast, but there was something different about her eyes. Distant, like she was already halfway gone. She told me to “be good,” kissed me on the forehead, and left through the front door. I sat in that house for three days before I realized no one was coming back. At first, I thought it was a test. Maybe I had done something wrong and this was a punishment. Or maybe she was trying to teach me how to survive without her. But as the days turned into weeks, and weeks into months, the narrative I built to protect myself started to crack. Relatives eventually stepped in—kind of. They fed me, clothed me, but no one really asked why she left. No one seemed surprised. It was as if everyone silently agreed: “She’s just like that.” I’m older now, but the shadow of that moment still lingers. I’ve replayed it thousands of times in my head. Was it my fault? Was it about her? Mental illness? Selfishness? Or survival? Here’s the question I can’t shake: Is there ever a situation where abandoning your child makes sense? Or is that always just a failure—plain and simple?",
    "upvotes": 322,
    "downvotes": 68
  },
  "comments": [
    {
      "author": "Isabela_Grace",
      "date": "24d ago",
      "text": "Death? Have you found traces of her online? No CPS to me feels like she died but no one wanted to tell you.",
      "upvotes": 170,
      "downvotes": 0
    },
    {
      "author": "Marshams2009",
      "date": "24d ago",
      "text": "I have tried multiple times to search her legal name on Facebook, but to no avail, she is wiped out from this earth's existence completely....",
      "upvotes": 104,
      "downvotes": 0
    },
    {
      "author": "straight_syrup_",
      "date": "24d ago",
      "text": "This post is chat gp t",
      "upvotes": 79,
      "downvotes": 0
    },
    {
      "author": "likeapolarbear",
      "date": "23d ago",
      "text": "Very new account, writing that is overly polished, an oddly detached manner of writing about an emotional situation…more signs it’s not from human hands Op, if you genuinely had this experience and wish to share and discuss it, please write about it on your own. Otherwise it comes off as farming engagement, which is pretty gross behavior on a sub like this",
      "upvotes": 37,
      "downvotes": 0
    },
    {
      "author": "Empty_Algae4508",
      "date": "23d ago",
      "text": "Yes because you can see the « —» being used which is typical of chat gp t. So maybe they used it to correct or translate their text.",
      "upvotes": 14,
      "downvotes": 0
    },
    {
      "author": "_peppermintbutler",
      "date": "23d ago",
      "text": "A very obvious one for sure",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "saxo81",
      "date": "23d ago",
      "text": "Offering a different perspective from a mother’s viewpoint. I think all parents go through emotional crap with their kids. However, as with most things some cope better with it than others. Recently I had a full mental breakdown mostly because i feel im not good for my son. The thought that he will be better off without me was so clear in my mind. Even with me dead he will be better off. I was incredibly lucky that I ended up with a care team that helped me work through it. Everyone is not that lucky … This will sound ridiculous (and now that i am out the other side i see that too). The thoughts start with minor things - mainly the school. He is clever, friendly but emotional and simply put, the school can’t deal with that. So everything that goes wrong in his class is blamed on him. One of the kids said he hates him and he is going to stab him with the knife and the schools reaction was i am overreacting, yet when my kid said he wants to be a ninja and catch bad guys when he grows up warranted a call from the school to tell me im raising a violent child. This is an example of events that plants the seed … “you are a bad mother”. Some brush it off and some of us don’t, can’t. My care team had to repeat over and over and over to me that leaving my son or killing myself will not leave him better off. And only now I am convinced they are right. I am NOT saying what your mum did was right. It was beyond fucked up. I think the only way you’ll really ever have closure is to have an answer from her. Maybe she was struggling mentally. Maybe she was convinced you would be better off. Maybe she had a plan in mind of how you things will go down once she is gone. Maybe there were circumstances beyond her control, perhaps trying to keep you safe? Maybe she is just selfish. But know, whatever the reason is … it is definitely not your fault.",
      "upvotes": 13,
      "downvotes": 0
    },
    {
      "author": "Tilion90",
      "date": "24d ago",
      "text": "You are her child, I'm sure you can go ask the police about some kind of death record or if she's even still alive. And it's not your fault. You were eleven years old. There's nothing you could have done that would make her abandon you. Whatever the reasoning behind her disappearance was, I'm sure it wasn't because of you. Take care.",
      "upvotes": 8,
      "downvotes": 0
    },
    {
      "author": "DiocorleoneV",
      "date": "24d ago",
      "text": "Listen Kid fiesta of all the track goes way back to your mothers childhood something in there was broken, she couldnt face it because she couldnt left a son behind is never easy even for the most despicable people, but even that is no justification for the fact, she took the desition to leave you in a rush tought to harm you the less, but never in any universe was your fault, hush Little Kid if i could go back i would just hug you so strong that the broken pieces wont fell off, i think and i hope you dont get offended by my Words, that you are Still holding on that same moment of the súper heavy loss that you had, and i know it because i have feel it the same way, its like the time stops and you get in that place, but the life will continué, and you just cant get the pace, with a lack of everything good, but you Keep trying on and make the effort but with no much advance, its not your fault, you didnt do anything, you were just a victim of the result of a big chain of disattention as well as your mother, who continué the chain of bad desitions in bad time and in the most vulnerable one, you have to understand you are not guilty, YOU ARE NOT GUILTY KIDDLE, its time to cry une more time, ha Eder that the others and for give the weakness of a other human who fuck it up, and who happens to be your mother, forgive her and step up from that table turned into a man who just accept what happened your reaction to that sad event is the only control we have, i deeply sorry for that Kid who suffered that much in a such early age. Keep your head up, or the crown may fell down, my Friend!! The Best wishes for you and your life !!",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "DennisSystemGraduate",
      "date": "23d ago",
      "text": "I wish I could go back in time and sit with you",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "seasonsofus",
      "date": "23d ago",
      "text": "She probably couldn’t handle raising a child as she was suffering herself. She probably thought that was the best thing to do. Don’t take that moment as something you were at fault for. You didn’t asked to be born, so it’s not on you",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": null,
      "date": "24d ago",
      "text": "i can feel you",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Lion_tattoo_1973",
      "date": "23d ago",
      "text": "My mum did the same when I was 8",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Strange_Reflections",
      "date": "24d ago",
      "text": "Postpartum depression caused me to nearly abandoned my family twice however it’s not your moms excuse as she was plenty past postpartum.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": null,
      "date": "24d ago",
      "text": "What you went through, is extremely traumatic, which shakes your core. I’m truly sorry for your dreadful experience. There is absolutely no reason to abandon your own child. Not even mental illness. Remember, it’s not you. It’s all 100% on her. You don’t have to walk through this alone. Book a therapist that specializes in PTSD and trauma. Do not even attempt online dating in the meantime (it’s rife with ghosting and all these experiences will be extremely triggering) Focus on yourself, in your survival and in your personal goals. Be the best you can be - for yourself.",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "AccomplishedWash4456",
      "date": "23d ago",
      "text": "This Happens so often I hate to see it",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "MilkSimple8681",
      "date": "23d ago",
      "text": "i dont know what kind of words cld soothe your ache. may u be safe and happy.",
      "upvotes": 1,
      "downvotes": 0
    }
  ],

  "thread_5": {
    "title": "Why are men like this bro (please no hate)",
    "content_warning": null,
    "author": "Far_Daikon_7419",
    "post_date": "25 days ago",
    "text": "A coworker i've known for 2 years i look up to, respect and has always been kind to me just said he thinks i'm sexy and keeps flirting with me. He has a wife and 4 children btw. He's almost 2 decades older than me btw (and well aware of that, he once said he could've been my dad) He's christian btw. I'm just... so dissapointed. I thought he wasn't like that. My mistake i guess. How do i cope with this",
    "upvotes": 263,
    "downvotes": 122
  },
  "comments": [
    {
      "author": "Embarrassed_Fan5866",
      "date": "25d ago",
      "text": "who would hate on this post 😭. trying to get with other women while you're in a committed relationship is a sad and despicable thing to do, it's not normal at all. the fact he has 4 kids on top of that makes it worse. this has nothing to do with the behaviour of men as a whole though i just think this one specific guy is a loser because most men would geniunely never do that.",
      "upvotes": 155,
      "downvotes": 0
    },
    {
      "author": "TheDeadInsideClub",
      "date": "25d ago",
      "text": "ugh, that’s such a horrible feeling. When someone you respected just turns out to be a complete letdown. especially when they hide behind things like faith or family. you didn’t do anything wrong, and it’s okay to feel confused or angry. i hope you’ve got someone in your corner, because stuff like this can really shake your trust in people.",
      "upvotes": 48,
      "downvotes": 0
    },
    {
      "author": "Scary-Wasabi-4407",
      "date": "25d ago",
      "text": "Please be careful and inform HR if things go too far. Trust your gut on this one. You don't want to be in a situation where it could cost you your position. A friend of mine used to be in a similar situation, and when things escalated, the company stood behind her older male colleague who brought more years of professional experience with him... I btw cope with facing the harsh reality that there are quite some men like that out there and stop putting men on pedestals. It's a slightly negative view unfortunately, but it helps me to spot early warning signs.",
      "upvotes": 28,
      "downvotes": 0
    },
    {
      "author": "EvolvingEachDay",
      "date": "24d ago",
      "text": "Frankly any older man who is particular close to you is a wrongun. No normal man wants to be close friends with a woman 20 years his junior. Sorry you found another creep.",
      "upvotes": 25,
      "downvotes": 0
    },
    {
      "author": "DadJokesAndDepth",
      "date": "24d ago",
      "text": "Being a man I concur with this. No man in his 40's has any business talking with a girl your age unless it is strictly work related.",
      "upvotes": 15,
      "downvotes": 0
    },
    {
      "author": "snowy24000",
      "date": "25d ago",
      "text": "The older you get, the more you will realise that unfortunately, some of the most kind and charming people you meet are only that on the surface. It's a veneer, and underneath, they are seriously rotten. It's not your fault it takes time to see through them. Just promise me one thing: You will immediately put up and hold firm boundaries against this person that's thinking you're an object to be used, and remember you are worth so much and that you don't need his approval. If you buy into his charm, you are in big trouble. Take it from a woman who knows.",
      "upvotes": 14,
      "downvotes": 0
    },
    {
      "author": "Very-very-sleepy",
      "date": "25d ago",
      "text": "I've had married men at work try to flirt with me. I usually rebuff it with. a joke about his wife. I would say in a joke tone of voice.. something like hey hey hey.. your married.. don't upset your wife bro. or you want your wife to kill both of us bro? lol oh hell no. I don't want your wife to kill me..lol or my favorite. where's your phone??.. I will have to tell your wife so she can spank you for being naughty.",
      "upvotes": 13,
      "downvotes": 0
    },
    {
      "author": "Perfect-Effect5897",
      "date": "24d ago",
      "text": "word of caution: with some men joking about their wives like that is like adding gasoline to the fire.",
      "upvotes": 30,
      "downvotes": 0
    },
    {
      "author": "kimariesingsMD",
      "date": "24d ago",
      "text": "That last comment is trashy AF and is likely to be viewed as interest and/or flirting back.",
      "upvotes": 16,
      "downvotes": 0
    },
    {
      "author": "Perfect-Effect5897",
      "date": "25d ago",
      "edited": "25d ago",
      "text": "Can't be disappointed if you are a realist. Christian men in my experience are the worst when it comes to shit like this. Probably has to do with the fact that getting married and having kids at an early age is encouraged and for many the only requirement when finding a spouse is that they share their faith. Not to mention the tight leash the faith has on these people. They lose their personality and become \"good church going people\" (droids) and lose touch with who they are as individuals. If they can't be themselves at home without judgement then it only makes sense they'll cheat. Marriages based on religion is a recipe for infidelity. I hope you've told him he's gross. That is something he needs to be told.",
      "upvotes": 10,
      "downvotes": 0
    },
    {
      "author": "TheNightSunOfTheDay",
      "date": "25d ago",
      "text": "Tell him to back off and that he disappointed you big time and you don't want him to speak to you ever again !",
      "upvotes": 9,
      "downvotes": 0
    },
    {
      "author": "Frysken",
      "date": "24d ago",
      "edited": "24d ago",
      "text": "Fellow man here. Lots of men, especially older ones, are gross and perverted. Not all of them of course, but an alarming amount are. I wish I could give an explanation as to why they feel so entitled and think that it's okay to do shit like this, but I really can't. I'm sorry you have to deal with this. I'd definitely reach out to HR for this. Also, he's not Christian. He may say he is, but fundamentally, he's not, if he's flirting with someone he's not married to. EDIT: To add on to what others are saying, a married man with kids has no business being close to a woman who's way younger than him unless it's work-related.",
      "upvotes": 8,
      "downvotes": 0
    },
    {
      "author": "kranools",
      "date": "25d ago",
      "text": "Most men are not like this.",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "Sugawara_Shamo",
      "date": "24d ago",
      "text": "Not to say you are lying but its more common to behave downright awful as a man than a woman, most people grandmothers were being cheated on while having 5+ kids.",
      "upvotes": 12,
      "downvotes": 0
    },
    {
      "author": "gdognoseit",
      "date": "24d ago",
      "text": "I’m sorry. It’s always disappointing when someone you respect shows you they’re nothing but a creep. Tell him you don’t want him talking to you like that and you would appreciate that he respects you enough to stop. If he doesn’t stop, report him.",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "onedemtwodem",
      "date": "24d ago",
      "text": "Ugh.. I'm so sorry OP. It's such a terrible feeling.",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "based_rbf",
      "date": "24d ago",
      "text": "Girl report his ass. Start there",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "PlentyFirefighter143",
      "date": "24d ago",
      "text": "This guy sucks. He’s a bad guy. Most of us are not like this. You are wise to recognize that everything you thought of him - that he’s kind and thoughtful- is out the door now that he’s romantically pursuing you. He’s “kind” because he’s trying to hook up with you -while he’s 20 years older with a spouse and 4 children at home. This is a terrible guy! I’m sorry this is happening to you. Stay away from that guy.",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "Friendly-Agency-4243",
      "date": "24d ago",
      "text": "Men by nature are polygamous. Christian or not. Very few actually deeply believe in monogamous. Hence, never try to get really close to a man, or make him your confident whether they are married or not. Grandpa or not. Men are predators, some learn how to hide it and fantasize about it in the dark, and some can’t help it but act on it. Only those filled with the spirit of Christ are actually free from this sinful male nature. Unfortunately, none can tell if a man is filled with Christ spirit or not. This is also to show how western culture with Judeo Christian values have helped and saved women from the horrible male nature. In most cultures women were married between age 9 - 16 or so, and they were second class citizens. Getting married as second or third wife. Insane where we come from. In a nutshell OP, take your distance from that creep and always remember not to blindly trust man until they prove themselves.",
      "upvotes": 0,
      "downvotes": 0
    }
  ],

  
  "thread_6": {
    "title": "I f**** lied to my therapist (for months) just to make her like me more",
    "content_warning": null,
    "author": "Lost-Sheepherder-467",
    "post_date": "24 days ago",
    "text": "I’ve been seeing my therapist for almost a year now. At first it was to get better, but then I started craving her approval. So I started hiding the worst parts: the thoughts, the self-sabotage, the stuff that would make me sound “crazy.” I’d talk about healing, about progress, even quote books I hadn’t read. She said she was proud of me last session. Truth is, I’ve been spiraling the WHOLE time. I feel like I’m addicted to being seen as \"the good client\" instead of actually getting better. And yeah, I know that’s messed up. But honestly? It feels better than being seen as broken. Anyone else ever fake being okay in therapy just to feel less disgusting for once? Cheers",
    "upvotes": 207,
    "downvotes": 46
  },
  "comments": [
    {
      "author": "Bipolar__highroller",
      "date": "24d ago",
      "text": "Therapist here. I take situations like this as “you didn’t feel safe to share yet”. Now that you’re aware of it and feel weird about it, bring it up and be honest. A good therapist will meet you where you’re at and be glad you finally felt safe enough to share. Also, this is probably a pattern you have in other relationships as well and I’m willing to bet it causes you some trouble. Don’t feel shame about it, you’re probably doing it for a reason or you had a reason at one time",
      "upvotes": 326,
      "downvotes": 0
    },
    {
      "author": "wonderingdragonfly",
      "date": "24d ago",
      "text": "Great advice here.",
      "upvotes": 43,
      "downvotes": 0
    },
    {
      "author": "EvolvingEachDay",
      "date": "24d ago",
      "text": "The juxtaposition of your username and your profession is absolute chefs kiss.",
      "upvotes": 34,
      "downvotes": 0
    },
    {
      "author": "Courtneyreads",
      "date": "24d ago",
      "text": "this is actually pretty normal (which shouldn’t be). i understand ur viewpoint because i’ve lied to my friends and family that im doing better but in truth am doing worse than before.",
      "upvotes": 31,
      "downvotes": 0
    },
    {
      "author": "Dry-Cause2061",
      "date": "24d ago",
      "text": "You need to tell your therapist the truth and tell her you've been lying about feeling good and progressing. She can't help you if you lie to her about feeling good. And if she thinks you're doing alright she might discharge you and you don't want that.",
      "upvotes": 19,
      "downvotes": 0
    },
    {
      "author": "Peanut2ur_Tostito",
      "date": "24d ago",
      "text": "I've lied about a few things before. Like my anorexia & still having it. She doesn't think I still have it. Otherwise I wouldn't be on weight loss medications. I know it's f'd up & a big one.",
      "upvotes": 11,
      "downvotes": 0
    },
    {
      "author": "MysticMonk-Key",
      "date": "24d ago",
      "text": "this is literally \"Imposter Syndrome\" gone wild -_- I know why most people would relate to this, excluding me & others who consider therapy as a means to an end --not the beginning of new illness lol Clearly you're a self-aware bloke with some genuine issues, so please be kind to yourself! Now that you've admitted this to a bunch of anonymous people on the internet, but more specifically to Yourself, it's time to face your Demon cos YOU GOT THIS 🤘🏻 Need more help? I'd love to offer however possible :)",
      "upvotes": 10,
      "downvotes": 0
    },
    {
      "author": "Leeleeflyhi",
      "date": "24d ago",
      "text": "I’m fine, it’s not a problem, hardly ever think of it, doesn’t bother me at all, blah blah blah. Yes I’m working on it, yes I feel better about, yes I’m coping blah blah blah We’ve ALL done it at some point to some degree in therapy. You see it, you admit it and that’s HUGE. Honesty with yourself is big stepping stone and if they’re a good therapist they will understand and make you feel safe to share how you truly feel. Plus they may know you weren’t honest and waiting for you to admit it to yourself I hope you find your peace ✌️",
      "upvotes": 9,
      "downvotes": 0
    },
    {
      "author": "Dry_Succotrash",
      "date": "24d ago",
      "text": "I did it to this therapist who was honestly amazing, and the best one I have met, and probably the only one who understood me and could help, but I lied to her because I craved her approval and I shouldn’t have done it, and now I regret it. She got a job another place three years ago and I wish I had been more vulnerable and let her help me. I’m trying to that now with my new therapists, because the important thing is that I actually heal. That should be the upmost priority. It’s sadly common, but now that you know it, you could maybe try and tell her the truth so she can actually help you and you can get better? It is her job to help you.",
      "upvotes": 7,
      "downvotes": 0
    },
    {
      "author": "meowzicalchairs",
      "date": "24d ago",
      "text": "Your therapist is the one person besides yourself you really need to be honest with.",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "Embarrassed-Dress-85",
      "date": "24d ago",
      "text": "To be honest, I am as straight forward an unhinged as I am. They get paid to fix my shit and that’s what I am there for in the first place, not to make friends. It probably takes a while to let go off the mask we usually wear in daily life, took me a while atleast. These days I can just instantly drop it once I am on their couch.",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "Icy-Fox-4699",
      "date": "24d ago",
      "text": "I'd tell her these exact words...",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "chefguy831",
      "date": "24d ago",
      "text": "This is absolutely something to bring up with your therapist brother. ",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Friendly-Agency-4243",
      "date": "24d ago",
      "text": "You are only lying to yourself. Come clean to her. And start over.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Limbitch_System0325",
      "date": "24d ago",
      "text": "i’m hiding the fact that i’m only “california sober”from my therapist and family while trying to kick that before it turns into yet another full-blown addiction. my mom knows from a hospital visit that i’ve had thc in my system somewhat recently and was relatively fine with that “slip”, but if she knew the real frequency with which i’m going through supply i don’t know what i’d do. i rebuilt a whole life outside of addiction that is now absolutely fantastic bc of all the hard work i put in but then i fell right back into the trap of substances. thankfully unlike my other vices, i’m not really all that psychologically dependent on marijuana so if i can just get myself to commit to the bit for a few weeks the cravings will go away. but of course i have nobody to talk to about this except my therapist—yet still i want to paint myself in a better light despite knowing all the little problems i have brewing right now could very easily boil over into a critical meltdown that absolutely tanks me. granted i also have a psychotic disorder and am naturally insanely paranoid, so the fear of opening up to my therapist is compounded by the fear—despite knowing 100% this is the opposite case—that she is going to break HIPAA and i’ll be sent back to rehab and lose my grants for school and have to drop out of classes and yada yada ya… it’s scary to admit you have a problem, but that’s the first stage in fixing it, whether you admit it to someone else or to yourself. you’ll get there someday, just like me.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "bitpixi",
      "date": "24d ago",
      "text": "Never felt the urge to do that. I want to track myself accurately",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "idreamofwhirledpeas",
      "date": "24d ago",
      "text": "“I got an A in therapy today. Yay!” I get it. I have worked hard over a long period of time, want nothing more than to feel well, and still am struggling. I know the drill. It can be exhausting to deal with what I know is coming if I fully disclose. Having to carefully word things so they are not misinterpreted and feeling a need to add a disclaimer when I do sucks: “I am sure that sounded really awful. I want to be clear I do not have a plan for self harm nor any intent.” Sometimes I don’t want to risk being told I have to do a safety plan I don’t need, or being told to try something that I already gave 100% to, didn’t work and wasn’t a good fit. I know the information backwards and forwards. I took away what I did find helpful and use it. Plus the shame of not doing well, again, and the very real risk that the more times things go sideways, I won’t be taken seriously and just. discounted/dismissed. I “fired” a therapist. for the first time ever, recently. Empowering when I realized it is ok to look for a better match. You need and deserve support from someone you trust right now.",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "darkvaderthesecond",
      "date": "24d ago",
      "edited": "24d ago",
      "text": "Having done a counselling course (only level 2 and some level 3 but i feel this would help) Counsellors or therapists accept this as a part of the process and even if tomorrow you owned up to 'lying' about your progress (though i'd argue it's still valid progress), they'd still accept you. It's not just their job to accept you, they work on themselves so they can accept you without prejudice. you don't have to work for their acceptance because their whole ideology is to accept you by default so that it allows you to explore how you feel and think and make lasting change for yourself. On top of that, progress isn't a straight line, it's about building the foundations for growth. Sometimes that means exploring 'bigging yourself up' or 'doing things wrong' for understanding and working through accepting why you're doing that. this post seems to be part of that. If i was your counsellor and you said that you felt what you said in this post then there's 2 things that come from that, first; you actually want to be/do better to the point that you're being something that doesn't reflect who you feel you are at this moment. that says a lot about you as a person and how truthfully caring you are about other people. Sure 'saving face' is not exactly the best position to be in but truthfully, it's obvious you care even if that's ended up in a misguided way. Secondly: their goal as part of the theraputic contract is to want to encourage you to eventually do the positive change by exploring with you why you're doing what you're doing. Personally, the fact you've acknowledged that you'd been less than truthful is great progress to making that change. it's never easy to accept that something isn't right especially when it's become second nature or automatic. Lastly, they're not some judge to criticise and punish, exploring and sharing intimate stuff is terrifying (did i say terrifying, i mean that 100000x but there's no word for that) and they accept that. if tomorrow you owned up that you've been dishonest to the progress and why, they'd not just be proud of you for owning up to it but also that they'd appreciate that you've taken stuff away from the sessions and you've explored things. that takes a lot. if it helps, you're more than welcome to explore my post with them, my lack of skill or understanding may show and they may disagree with my interpretations but if it helps you are absolutely more than welcome. Hopefully my post helps.",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "CurlyWoman235",
      "date": "24d ago",
      "text": "I lied to my therapist because I felt like she expected me to be better by a certain date, if that makes sense. When she used to ask me how things in my life are going, I said good or fine, when they weren't. She always tried to compare my situation with hers and how she dealt with it.",
      "upvotes": 1,
      "downvotes": 0
    }
  ],

  
  "thread_7": {
    "title": "Why have I become so sensitive all of a sudden?",
    "content_warning": null,
    "author": "Lost-Sheepherder-467",
    "post_date": "24 days ago",
    "text": "I used to have really thick skin about stuff and I would often take a lot of shit and jokes from people at my school, which would never really offend me tbh. However, ever since March of this year, I haven't been the same, and nowadays I'll become very depressed over the slightest negative thing that someone else says about me. For example, before March, the people at my school could say the most awful things about me as a \"joke\" and I wouldn't get offended at all. However, a few days ago some guy from my church called me a fat retard for some reason as a joke (Way more mild than the stuff I was called when school was still in) and I almost felt like crying, which seems really dumb especially if you knew me in person and know how I am, but it made me realize I really am not the same. Another example is when my mom will get slightly upset over something I did wrong, now for some reason I will become really irritable and snappy, and I feel very depressed. I might know what started all of this, and where my mental health really fell off, but you can skip to the end if you don't feel like reading it all because it is a pretty long explanation. Up until maybe the start of 2025 I had a few suspicions that my mental health was a little unwell but it was nothing too serious. Then, comes early 2025, I start to become slightly depressed due to loneliness and stuff like that, as my best friend of like 8 years stopped talking to me and I had never had a girlfriend or anything due to low self esteem and anxiety. Around late February, I was on discord a lot, and suddenly I got a friend request from a girl frommy friend's discord server. We talked for a few days, nothing too personal since she took forever to respond lmao but she had mentioned how she was pretty lonely Next day, I'm travelling a few hours to one of my state colleges for this School science competition thingy. I spent the whole day there at the college. However, I was super lonely during this whole thing because I had literally no one to talk to yet I was surrounded by hundreds of people, which kinda messed with me. I started to get into my head even more than usual, and I started thinking about bad things, like how pointless life is, if there is a God, why I'm so lonely, etc. Another thing that messed with me is that my former best friend was there, yet he never tried talking to me or anything, I felt lonely and depressed that day like I had never felt before. The next day, I was talking to that girl from before, and I asked how she was. She told me that \"she wasn't feeling well\", and I asked why, she told me that \"everyone she knows is a jerk to her and she was feeling really depressed and even having thoughts about self harm\". This really resonated with me, as the previous day I was feeling the same way. I told her about how I felt and stuff and we talked about stuff like that for a while. She became the first person in my whole life I could open up to about my depressed thoughts. And then all of a sudden, out of nowhere, she told me \"Yeah I know you like talking to me but just to let you know I have a boyfriend sorry\". Or something like that. That really messed with me, not because of the whole boyfriend thing, but because I felt like I was suddenly being pushed away after opening up about something sensitive like that for the first time. That has messed with me since. idk if my story is relevant but I'd appreciate it if any of you guys understand what might be wrong.",
    "upvotes": 2,
    "downvotes": 1
  },
  "comments": [
    {
      "author": "Olistu_",
      "date": "15m ago",
      "text": "I think You Got beaten up your whole life without realising without being hurt But now all of that idk trauma is falling down on you After every friend you have left You were left alone sad and all the different things people have said finally hit you",
      "upvotes": 0,
      "downvotes": 0
    }
  ],

  "thread_8": {
    "title": "I want to know if anyone is in a similar situation or has any advice",
    "content_warning": null,
    "author": "Which-Inspector5340",
    "post_date": null,
    "text": "I’ve never admitted this to ANYONE so this is a throwaway. Basically I (17F) have a bunch of people in my head. I am a completely separate person and I know they’re not me like it’s not any sort of identity disorder. It’s just a bunch of characters that I’ve picked up from various movies or scenarios or whatever. I am a maladaptive daydreamer so I spend a lot of time basically chatting to them or imagining them watching my life and seeing what I’m doing and saying what they think about it. I don’t know. It’s really strange I’ve been doing it since I can remember it’s just sometimes the characters change or they get added. I really want to know I’m not alone or get any advice on how I can go about managing this. I was blown away with how many people maladaptive daydream as I thought that was just me initially. I have face-to-face therapy but this is something so private I really can’t tell her. My parents don’t even know. But yeah I just wanted to get it out and see if anyone has anything similar. I don’t know",
    "upvotes": 1,
    "downvotes": 3
  },
  "comments": [
    {
      "author": "Olistu_",
      "date": "21m ago",
      "text": "Doesnt seem like dangerous since you can tell there fake Talk to a doctor about this (if your ok with doing that) So it could just be a very active imagination",
      "upvotes": 0,
      "downvotes": 0
    },
    {
      "author": "Which-Inspector5340",
      "date": "8m ago",
      "text": "Yeah no I’m completely aware they’re just characters. They’re like completely separate from me. I’m definitely trying to work up to that stage but I’m terrified as it’s basically such a personal thing and I’m not good at sharing. This is my first step in that direction.",
      "upvotes": 0,
      "downvotes": 0
    }
  ],
  "thread_9": {
    "title": "What causes a lack of empathy?",
    "content_warning": null,
    "author": null,
    "post_date": "5d ago",
    "text": "Due to a trauma related disorder, I lack empathy. I am wondering what specific things in childhood can cause this",
    "upvotes": 57,
    "downvotes": 31
  },
  "comments": [
    {
      "author": "AdamOfIzalith",
      "date": "5d ago",
      "text": "Generally as a child, if empathy is punished in their environments, it's something people learn to turn off and sometimes they can't turn it back on, even when their environment changes.",
      "upvotes": 42,
      "downvotes": 0
    },
    {
      "author": "ColdFemboi",
      "date": "5d ago",
      "text": "Incidentally, this is a major problem for boys who grow up in a toxic male environment. They are taught that showing and feeling empathy goes against traditional masculinity.",
      "upvotes": 17,
      "downvotes": 0
    },
    {
      "author": "Realistic_Pomelo_876",
      "date": "5d ago",
      "text": "That actually makes a lot of sense",
      "upvotes": 8,
      "downvotes": 0
    },
    {
      "author": "Fakr_",
      "date": "5d ago",
      "text": "It might not be that you lack empathy, but rather that your brain has put up protective walls around it. Trauma, especially in childhood, can make the emotional brain go into survival mode, it is numbing out feelings like empathy because they were overwhelming or unsafe at the time. This doesn’t mean empathy is gone. It’s more like it’s been locked away for self-preservation. You may not feel it or show it the way you expect to right now, but with healing and self-awareness, it often starts to resurface. Be gentle with yourself, feeling disconnected or numb is pretty normal and a natural response of your brain to protect your well being.",
      "upvotes": 24,
      "downvotes": 0
    },
    {
      "author": "kristenintechnicolor",
      "date": "5d ago",
      "text": "Completely agree with this. When you’re constantly in survival mode, you will eventually crash. It can feel like extreme burnout, depression, or apathy/ numbness.",
      "upvotes": 7,
      "downvotes": 0
    },
    {
      "author": "No-Secret-8940",
      "date": "5d ago",
      "text": "Most likely you didn't have people around you at the time to protect you when you needed it most",
      "upvotes": 12,
      "downvotes": 0
    },
    {
      "author": "killmalik",
      "date": "5d ago",
      "text": "How can I feel empathy nobody empathized with me and still don’t",
      "upvotes": 6,
      "downvotes": 0
    },
    {
      "author": "Parentingbridge",
      "date": "5d ago",
      "text": "Empathy is a learned behavior. If a child doesn't have empathetic role models, they may not develop the skills to understand or expressit themselves,",
      "upvotes": 6,
      "downvotes": 0
    },
    {
      "author": "Leohond15",
      "date": "5d ago",
      "text": "Empathy must be nurtured with love, demonstration of it, reading, being around animals and babies. If this doesn’t happen, and the child is also rewarded for being cruel, or shamed and punished for being kind and empathetic, it won’t be there. It’s very easy to breed a savage.",
      "upvotes": 6,
      "downvotes": 0
    },
    {
      "author": "LessPossibility2939",
      "date": "5d ago",
      "text": "Oh man I would love to lack empathy. My empathy is beyond normal and it makes me sick, but litteraly.",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "uhhhhhhhhii",
      "date": "5d ago",
      "text": "Childhood truama",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "Top_Inspector_7352",
      "date": "5d ago",
      "text": "Narcissistic personality disorder",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "WittyEgg2037",
      "date": "5d ago",
      "text": "lack of empathy doesn’t just come from individual trauma it’s also the culture we’re raised in. when you grow up in a world where survival depends on competing instead of connecting, you learn to numb out. if life keeps telling you “your value is what you produce, not who you are,” (thanks to capitalism) empathy starts to feel like a liability. some people call it trauma, but honestly, it’s also just what happens when a society rewards disconnection over care.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "hypnoticlife",
      "date": "5d ago",
      "text": "Feeling like you deserve all the empathy first. Trying to fill your own void of validation and comfort.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Top_Squash4454",
      "date": "5d ago",
      "edited": "5d ago",
      "text": "Entitlement and paradoxally, hypersensitivity (being too self absorbed in one's feelings to care about others)",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "ivoryfaker",
      "date": "5d ago",
      "text": "Typically neglect. Neglect causes antisocial behaviors…. You don’t have to empathize with anybody if you’re the only person you’re used to. It takes genuine effort to empathize with others if it doesn’t come naturally to you , or you weren’t raised with it. If you were constantly having to protect yourself, this could also cause you to not be able to empathize with others…. It takes genuine effort. So I would say as an adult, what causes a lack of empathy would probably be laziness. Like what causes obesity? Yeah, there are a lot of determining factors and bad nurturing and programming and disorders, but at the end of the day, if you work really, really hard… you can lose weight, and you can have empathy.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "h0pe2",
      "date": "5d ago",
      "text": "Severe depression burnout",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Proper-Jump-6841",
      "date": "5d ago",
      "text": "Insensitive ang pinapakita mo sa Kapwa. Selfish Para sa akin ayan. Pero puwede pa mag-improved iyan, basta try mo minsan magkusang tumulong sa Kapwa consistently. Try mo rin unawain ang karanasan or sitwasyon ng tao ng may genuine and understanding. I hope makatulong ito sa iyo.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Individual_Card4409",
      "date": "5d ago",
      "text": "In childhood- growing up with adults who mocked or punished or dismissed feelings. In a home that's not safe or stable. Children in chronic stress \"survival mode\"- makes it difficult to \"tune\" into other's people's feelings.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "PsychologicalEcho794",
      "date": "5d ago",
      "text": "No punishment",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "KarmaNforcer007",
      "date": "5d ago",
      "text": "Lots of 💲💲💲💲💲💲💲",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "Original_Mulberry_82",
      "date": "5d ago",
      "text": "You are emotional inhibited limited and numb. Can be several causes. But what matters is you don't feel it consciously doesn't mean empathy isn't there inside you",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "Bubblegumcats33",
      "date": "5d ago",
      "text": "Selfishness",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "NIKHAALAS",
      "date": "5d ago",
      "text": "Trauma, neglect, narcissism, stress, isolation.",
      "upvotes": 1,
      "downvotes": 0
    },
    {
      "author": "brokenglitterhearts",
      "date": "5d ago",
      "text": "Animalistic reptilian brain",
      "upvotes": 1,
      "downvotes": 0
    }
  ],

  "thread_10": {
    "title": "Finally deleted Instagram",
    "content_warning": null,
    "author": "AdSalty4314",
    "post_date": "21 days ago",
    "text": "As a 18yo I realized I am addicted to Instagram. I would spend HOURS scrolling reels and get nothing back from it. Also just the pressure from being perfect and having to deal with so much bs made me, at last, delete that damned app. Its been 4 days and im already feeling much better",
    "upvotes": 187,
    "downvotes": 54
  },
  "comments": [
    {
      "author": "BarleysAttic",
      "date": "21d ago",
      "text": "That is awesome! It can be so hard to break out of that kind of a cycle, but I am so proud of you for doing it! It is totally worth celebrating and a wonderful act of self-care! :)",
      "upvotes": 17,
      "downvotes": 0
    },
    {
      "author": "AdSalty4314",
      "date": "21d ago",
      "text": "Thanks, it was something I was building up the courage to do for a really long time",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "Lumpy-Artichoke-4501",
      "date": "21d ago",
      "text": "Deleted my Facebook app in December and haven't turned back! It's liberating",
      "upvotes": 11,
      "downvotes": 0
    },
    {
      "author": "jamesandlily_forever",
      "date": "21d ago",
      "text": "Deleted mine in Feb! Best feeling ever.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Purc_30",
      "date": "21d ago",
      "text": "Hell yeah!! That’s so awesome! I just did the same thing 2 days ago and it does feel so much better! It rly can help your mind feel less muddled all the time!",
      "upvotes": 5,
      "downvotes": 0
    },
    {
      "author": "throwawayforthrall",
      "date": "21d ago",
      "text": "Yo! I just did the same thing last week. It’s been great 👍 good luck!! Keep it up :)",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": null,
      "date": "21d ago",
      "text": "I deleted all social media besides tiktok and it was the best decision ever! Now I need to work on removing tiktok lol",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "One_Dragonfly_313",
      "date": "21d ago",
      "text": "I deleted Facebook months ago, and recently got rid of TikTok. I spent years stuck in doomscrolling mode. The wake-up call I had was when a video of this girl came across my fyp. She talked about how doomscrolling was affecting her memory. I realized that what she was describing, I was experiencing the same symptoms. There's a lot of evidence that scrolling through short-form content does affect your attention span and short-term memory. Your brain gets used to taking in short bits of information and expelling them. Anyway, I left the spot on my phone where TikTok's icon was blank. My brain was so addicted that I still find myself subconsciously going to it when I'm idle. Having that spot blank is a reminder to find something more productive to do. I've been reading and writing again. It feels so free to be in control of the content I consume. I use my time as I want.",
      "upvotes": 3,
      "downvotes": 0
    },
    {
      "author": "Fresh-Cockroach5563",
      "date": "21d ago",
      "text": "Nice job! I remember when it was great for sharing photos with friends and family but meta made it terrible.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "jamesandlily_forever",
      "date": "21d ago",
      "text": "It really sucks now. I deleted mine. I never saw pics of friends or anything.",
      "upvotes": 4,
      "downvotes": 0
    },
    {
      "author": "Moresh_Morya",
      "date": "21d ago",
      "text": "That’s a solid move. Most people know it's draining but don’t have the guts to actually delete it. Four days in and already feeling lighter? That says a lot. Hope you keep going real life >>> infinite scroll.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "CuriousPressure797",
      "date": "21d ago",
      "text": "I’ve found that quitting cold turkey unfortunately never does the trick. You’ll crave it eventually. Take baby steps. Put time limit restrictions for each day. Give yourself that little piece until you don’t need it anymore.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "WhatUpDoge555",
      "date": "21d ago",
      "text": "I just did today too. 21 yo. I hope to not install it again for at least a month and then we’ll see from there.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Daysys04",
      "date": "21d ago",
      "text": "That takes real strength, especially when so much of our world is wrapped up in apps like that. It’s not just deleting Instagram, it’s choosing your peace over pressure. I’m really proud of you, even if we’ve never met. Keep holding on to that feeling of freedom. You deserve it",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "true_intuitions",
      "date": "21d ago",
      "text": "I’ve been off social media for 2 months now, and honestly, I feel so much better. I don’t need to keep up with other people’s lives.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Parking_Analyst2983",
      "date": "21d ago",
      "text": "Let’s go dude! Congrats. I’m still working my way to deleting all my socials, but when you finally decide to commit to deleting one… nothing feels better.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Several_Jelly8814",
      "date": "18d ago",
      "text": "Be careful, deleting IG is a first step, now you need to make sure you do something else that is NOT digital at the time you’re not using IG, because your brain will just make you scroll something else for hours - Reddit, YouTube etc. this is why most people fail, because it’s not the instagram that is addictive per se, but the internet in general became a never ending void of quick dopamine hits.",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "ZeusRahmen",
      "date": "21d ago",
      "text": "I would like to do that too. But its so relaxing, scrolling through insta whilst laying in bed. What do you people do instead? I cant read, because I cant concentrate 🥺",
      "upvotes": 0,
      "downvotes": 0
    }
  ],

  "thread_11": {
    "title": "I finally realize my worth",
    "content_warning": null,
    "author": null,
    "post_date": "4h ago",
    "text": "I’m fully worthless and I don’t care anymore cause I realize I can’t even do the simplest things at the age of 23. I’m pathetic and I’m just waiting on the day when I’ll finally leave the place that took my worth from me or maybe I never had any to begin with. Love is bullshit unless it’s platonic and even making new friends or meeting people just gets you hurt when they can’t handle you or don’t want you around anymore so they throw you out like the trash you are. People you’ve known forever and you even remember important events for can’t even do the same in vice versa or at least make time to talk to you. I’m not asking for your day or your time but just to talk to my friend but I guess it gets to the point you don’t even matter anymore. The only person or people that ever make me feel like I have worth are two friends on here and my best friend I’ve known forever cause I don’t know where I’d be without him but I’m just waiting until the day he gets sick of me. I wish I wasn’t born all the time and I don’t want to be a burden anymore and if I’m lucky one day I’ll get my wish to not be here anymore. I’ve almost died twice and I can’t kick the bucket properly so maybe I’m just supposed to suffer this hell and I guess the depression is the icing on top of this shit cake.",
    "upvotes": 4,
    "downvotes": 3
  },
  "comments": [
    {
      "author": "Electronic-Army6723",
      "date": "4h ago",
      "text": "Read that back again. Now try and think about those things you wrote in more of a growth mindset rather than a fixed mindset. I'll have a go for you... I’m fully worthless and I don’t care anymore cause I realize I can’t even do the simplest things at the age of 23.  I've been struggling a lot lately, but despite these challenges I keep going. I know that I maybe should be able to do more at age 23, and maybe that is because I don't have someone who I could rely on to teach me those much needed life lessons. However I can make a list of these things and try and figure this out for myself, perhaps I could ask someone older for some advice, or I could follow some videos on youtube/tik tok. I’m pathetic and I’m just waiting on the day when I’ll finally leave the place that took my worth from me or maybe I never had any to begin with. I'm overwhelmed with the way I feel, but I willing to try and understand my emotions and move forward. Eventually I will get away from the people and the places that I feel have held me back, I am going to make that happen one baby step at a time. Love is bullshit unless it’s platonic and even making new friends or meeting people just gets you hurt when they can’t handle you or don’t want you around anymore so they throw you out like the trash you are. I haven't found meaningful love yet in my life... but hell I'm only 23, there is plenty of time to find love! I know love can come with a lot of ups and downs, and I might have to experience some really shit things before I value what love is properly. What I really need to do is learn to love myself fully before I am going to be able to love anyone else or accept love from anyone else. I am going change the way I think about myself! And yeah, some people will hurt me along the way, but I am strong, I can't control what others do but I can control how I react and respond. I can be a more mature person and handle rejection in a healthy way. People you’ve known forever and you even remember important events for can’t even do the same in vice versa or at least make time to talk to you. I’m not asking for your day or your time but just to talk to my friend but I guess it gets to the point you don’t even matter anymore. Other people are pretty busy with their own lives. I do my best to be inclusive and try to make other feel special, remembering things that matter to them, but even if they don't do the same for me it doesn't mean they like me any less, they are just juggling a load of other stuff. In all honesty I am not the centre of everyone else's world - only my own!! I am going to keep leading by example though, if people are genuinely vindictive then I don't need them in my circle, but if my friends are just busy, forgetful ADHD as hell I have to accept they still care about me they just suck at showing it in practical ways!",
      "upvotes": 2,
      "downvotes": 0
    },
    {
      "author": "Electronic-Army6723",
      "date": "4h ago",
      "text": "The only person or people that ever make me feel like I have worth are two friends on here and my best friend I’ve known forever cause I don’t know where I’d be without him but I’m just waiting until the day he gets sick of me.  I am so lucky I have two amazing friends on here and my best friend. They know what I am like, and they accept me, even when I am bloody hard to be around! I worry he will get sick of me, but really I know he worries about me, and I am going to work hard on myself to get my head back in the game, He deserves a good friend too and I know I can be there for him too.",
      "upvotes": 2,
      "downvotes": 0
    }
  ]
}
